Selmi-Med-Dhia/Dino_Game_Auto_Player_ESP32/src/main.cpp
  bool hasSaved = prefs.getBytesLength("config") == sizeof(config);
  bool migrated = false;
  if (hasSaved) prefs.getBytes("config", &config, sizeof(config));
  if (hasSaved && config.magic == CONFIG_MAGIC && config.version == 1) {
    migrateV1(config);
    migrated = true;
  }

  if (!hasSaved || !configValid(config)) {
    config = Config{};
    prefs.putBytes("config", &config, sizeof(config));
    Serial.println("[NVS] Defaults loaded and saved.");
  } else {
    if (migrated) prefs.putBytes("config", &config, sizeof(config));
    Serial.println(migrated ? "[NVS] Configuration migrated."
                            : "[NVS] Saved configuration loaded.");
  }

  sensorRatio = prefs.getFloat("ratio", DEFAULT_SENSOR_RATIO);
  if (sensorRatio < 0.5f || sensorRatio > 6.0f) sensorRatio = DEFAULT_SENSOR_RATIO;
}

// Sensor and timing model --------------------------------------------------

int readSensor() { return analogRead(SENSOR_PIN); }

int median3(int a, int b, int c) {
  if (a > b) { int t = a; a = b; b = t; }
  if (b > c) { int t = b; b = c; c = t; }
  if (a > b) b = a;
  return b;
}

bool classifyWhite(int adc, int threshold, bool previous) {
  return previous ? adc > threshold - SENSOR_HYSTERESIS
                  : adc > threshold + SENSOR_HYSTERESIS;
}

void resetEnvelopeLocked() {
  detector.active = false;
  detector.startMs = 0;
  detector.lastObstacleMs = 0;
  detector.oppositeSinceMs = 0;
}

void resetTimingLocked() {
  detector = Detector{};
  detector.travelMs = config.travelMs;
}

uint32_t speedPulseLocked() {
  uint32_t values[HISTORY_SIZE];
  for (size_t i = 0; i < detector.historyCount; ++i) values[i] = detector.history[i];
  for (size_t i = 1; i < detector.historyCount; ++i) {
    uint32_t v = values[i];
    size_t j = i;
    while (j && values[j - 1] > v) {
      values[j] = values[j - 1];
      --j;
    }
    values[j] = v;
  }
  size_t index = (detector.historyCount * 35) / 100;
  return values[index < detector.historyCount ? index : detector.historyCount - 1];
}

void updateTravelLocked(uint32_t pulseMs) {
  detector.history[detector.historyIndex] = pulseMs;
  detector.historyIndex = (detector.historyIndex + 1) % HISTORY_SIZE;
  if (detector.historyCount < HISTORY_SIZE) ++detector.historyCount;

  uint32_t pulse = speedPulseLocked();
  if (!detector.baselinePulseMs && detector.historyCount >= ADAPT_WARMUP)
    detector.baselinePulseMs = pulse;
  if (!config.adapt || !detector.baselinePulseMs || pulse >= detector.baselinePulseMs) return;

  float target = static_cast<float>(config.travelMs) * pulse /
                 detector.baselinePulseMs * ADAPT_SAFETY_BIAS;
  if (target < config.minTravelMs) target = config.minTravelMs;
  if (target >= detector.travelMs) return;

  uint32_t drop = static_cast<uint32_t>(detector.travelMs * config.adaptStepPct / 100.0f);
  if (!drop) drop = 1;
  uint32_t floor = detector.travelMs > drop ? detector.travelMs - drop : config.minTravelMs;
  detector.travelMs = static_cast<uint32_t>(target > floor ? target : floor);
  if (detector.travelMs < config.minTravelMs) detector.travelMs = config.minTravelMs;
}

void clearClickQueue() {
  ClickCommand ignored{};
  while (clickQueue && xQueueReceive(clickQueue, &ignored, 0) == pdTRUE) {}
}

bool queueClick(uint64_t atMs, bool manual, const Config &cfg) {
  ClickCommand cmd{atMs, playGeneration, cfg.pressAngle, cfg.restAngle,
                   cfg.holdMs, manual, cfg.debug};
  if (xQueueSend(clickQueue, &cmd, 0) == pdTRUE) return true;
  queueLog("[WARN] Servo queue full; click dropped.");
  return false;
}

bool queueClick(uint64_t atMs, bool manual) {
  return queueClick(atMs, manual, getConfig());
}

void insertPending(ClickCommand *pending, size_t &count, const ClickCommand &cmd) {
  if (count >= CLICK_QUEUE_SIZE) return;
  size_t i = count;
  while (i && pending[i - 1].atMs > cmd.atMs) {
    pending[i] = pending[i - 1];
    --i;
  }
  pending[i] = cmd;
  ++count;
}

void prunePending(ClickCommand *pending, size_t &count) {
  size_t out = 0;
  for (size_t i = 0; i < count; ++i) {
    if (pending[i].manual ||
        (playing && pending[i].generation == playGeneration)) {
      pending[out++] = pending[i];
    }
  }
  count = out;
}

// Servo task ---------------------------------------------------------------

void servoTask(void *) {
  ClickCommand pending[CLICK_QUEUE_SIZE]{};
  size_t count = 0;

  for (;;) {
    prunePending(pending, count);
    TickType_t wait = portMAX_DELAY;
    if (count) {
      uint64_t now = nowMs();
      uint64_t ms = pending[0].atMs > now ? pending[0].atMs - now : 0;
      wait = ms ? pdMS_TO_TICKS(static_cast<uint32_t>(ms)) : 0;
    }

    ClickCommand incoming{};
    if (xQueueReceive(clickQueue, &incoming, wait) == pdTRUE) {
      insertPending(pending, count, incoming);
      continue;
    }
    if (!count) continue;

    ClickCommand cmd = pending[0];
    for (size_t i = 1; i < count; ++i) pending[i - 1] = pending[i];
    --count;
    if (!cmd.manual && (!playing || cmd.generation != playGeneration)) continue;

    uint64_t actual = nowMs();
    servo.write(cmd.pressAngle);
    TickType_t hold = pdMS_TO_TICKS(cmd.holdMs);
    vTaskDelay(hold ? hold : 1);
    servo.write(cmd.restAngle);

    if (cmd.debug) {
      uint64_t late = actual > cmd.atMs ? actual - cmd.atMs : 0;
      queueLog("[CLICK] task-late=%llu ms",
               static_cast<unsigned long long>(late));
    }
  }
}

void finalizeEnvelopeLocked(uint64_t now) {
  if (!detector.active || detector.lastObstacleMs < detector.startMs) {
    resetEnvelopeLocked();
    return;
  }

  uint32_t pulseMs = static_cast<uint32_t>(detector.lastObstacleMs - detector.startMs);
  if (!pulseMs) pulseMs = 1;
  updateTravelLocked(pulseMs);

  float edgeFraction = sensorRatio / (2.0f * (sensorRatio + 1.0f));
  int64_t correction = static_cast<int64_t>(pulseMs * edgeFraction);
  int64_t entry = static_cast<int64_t>(detector.startMs) + correction + detector.travelMs;
  int64_t exit = static_cast<int64_t>(detector.lastObstacleMs) - correction + detector.travelMs;
  int64_t exitContact = exit + config.landingMs - config.airMs;
  int64_t safeContact = entry - config.clearanceMs;
  int64_t commandAt = (exitContact < safeContact ? exitContact : safeContact) - config.actuatorMs;

