Selmi-Med-Dhia/Dino_Game_Auto_Player_ESP32/src/main.cpp
  bool entrySafety = safeContact < exitContact;
  bool delayedLanding = false;
  bool delayedCooldown = false;
  if (detector.hasPlan) {
    int64_t afterLanding = static_cast<int64_t>(detector.lastLandingMs) +
                           config.rearmMs - config.actuatorMs;
    int64_t afterCooldown = static_cast<int64_t>(detector.lastCommandMs) + config.cooldownMs;
    if (commandAt < afterLanding) {
      commandAt = afterLanding;
      delayedLanding = true;
    }
    if (commandAt < afterCooldown) {
      commandAt = afterCooldown;
      delayedCooldown = true;
    }
  }

  uint64_t lateMs = 0;
  if (commandAt < static_cast<int64_t>(now)) {
    lateMs = static_cast<uint64_t>(static_cast<int64_t>(now) - commandAt);
    commandAt = static_cast<int64_t>(now);
  }

  const char *reason = lateMs ? "sensor-too-close" :
                       delayedLanding ? "post-landing-rejump" :
                       delayedCooldown ? "cooldown" :
                       entrySafety ? "entry-safety" : "exit-aligned";
  uint64_t executeAt = static_cast<uint64_t>(commandAt);

  if (queueClick(executeAt, false, config)) {
    ++detector.plannedJumps;
    detector.lastCommandMs = executeAt;
    detector.lastLandingMs = executeAt + config.actuatorMs + config.airMs;
    detector.hasPlan = true;
    queueLog("[PLAN] #%lu pulse=%lu travel=%lu cmd-in=%lld late=%llu %s",
             static_cast<unsigned long>(detector.plannedJumps),
             static_cast<unsigned long>(pulseMs),
             static_cast<unsigned long>(detector.travelMs),
             static_cast<long long>(
                 static_cast<int64_t>(executeAt) - static_cast<int64_t>(now)),
             static_cast<unsigned long long>(lateMs), reason);
  }
  resetEnvelopeLocked();
}

// Sensor / planner task ----------------------------------------------------

void sensorTask(void *) {
  TickType_t wake = xTaskGetTickCount();
  int first = readSensor();
  int samples[3] = {first, first, first};
  size_t sampleIndex = 0;
  filteredWhite = first > config.threshold;

  for (;;) {
    Config cfg = getConfig();
    vTaskDelayUntil(&wake, pdMS_TO_TICKS(cfg.sampleMs));
    samples[sampleIndex] = readSensor();
    sampleIndex = (sampleIndex + 1) % 3;
    int adc = median3(samples[0], samples[1], samples[2]);
    uint64_t now = nowMs();
    bool themeChanged = false;
    bool newBackground = false;

    xSemaphoreTake(stateMutex, portMAX_DELAY);
    lastSensorValue = adc;
    filteredWhite = classifyWhite(adc, config.threshold, filteredWhite);
    if (playing) {
      bool obstacle = filteredWhite != backgroundIsWhite;
      if (config.theme == ThemeMode::Auto) {
        if (obstacle) {
          if (!detector.oppositeSinceMs) detector.oppositeSinceMs = now;
          if (now - detector.oppositeSinceMs >= config.themeFlipMs) {
            backgroundIsWhite = filteredWhite;
            newBackground = backgroundIsWhite;
            resetEnvelopeLocked();
            obstacle = false;
            themeChanged = true;
          }
        } else {
          detector.oppositeSinceMs = 0;
        }
      }

      if (obstacle) {
        if (!detector.active) {
          detector.active = true;
          detector.startMs = now;
        }
        detector.lastObstacleMs = now;
      } else if (detector.active && now - detector.lastObstacleMs >= config.gapMs) {
        finalizeEnvelopeLocked(now);
      }
    }
    xSemaphoreGive(stateMutex);

    if (themeChanged) {
      queueLog("[THEME] Background rebased to %s.", colorName(newBackground));
    }
  }
}

void chooseBackground() {
  int adc = readSensor();
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  lastSensorValue = adc;
  filteredWhite = adc > config.threshold;
  backgroundIsWhite = config.theme == ThemeMode::Light ? true :
                      config.theme == ThemeMode::Dark ? false : filteredWhite;
  xSemaphoreGive(stateMutex);
}

// Serial console -----------------------------------------------------------

void printManual() {
  Serial.println("\nstart | arm | stop | click | show | sensor | reset | defaults");
  Serial.println("theme auto|light|dark");
  Serial.println("<name> <value>  (auto-saved)");
  Serial.println("threshold rest press hold actuator travel mintravel air landing");
  Serial.println("clearance gap sample cooldown rearm ratio adapt adaptstep debug");
  Serial.println("Example: press 38   travel 1550   ratio 2.0   adapt on\n");
}

void printStatus() {
  Config cfg = getConfig();
  int adc = readSensor();
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  float ratio = sensorRatio;
  uint32_t effective = detector.travelMs;
  bool bg = backgroundIsWhite;
  xSemaphoreGive(stateMutex);

  Serial.println("\n=== Dino Auto-Player ===");
  Serial.printf("Run=%s | sensor=%d (%s) | threshold=%d | background=%s | theme=%s\n",
                playing ? "ON" : "OFF", adc, colorName(adc > cfg.threshold),
                cfg.threshold, colorName(bg), themeName(cfg.theme));
  Serial.printf("Servo: rest=%d press=%d hold=%lu ms\n", cfg.restAngle, cfg.pressAngle,
                static_cast<unsigned long>(cfg.holdMs));
  Serial.printf("Timing: actuator=%lu travel=%lu effective=%lu air=%lu landing=%lu clearance=%lu\n",
                static_cast<unsigned long>(cfg.actuatorMs), static_cast<unsigned long>(cfg.travelMs),
                static_cast<unsigned long>(effective), static_cast<unsigned long>(cfg.airMs),
                static_cast<unsigned long>(cfg.landingMs), static_cast<unsigned long>(cfg.clearanceMs));
  Serial.printf("Sensor: sample=%lu ms gap=%lu ms ratio=%.2f:1 hysteresis=%d\n",
                static_cast<unsigned long>(cfg.sampleMs), static_cast<unsigned long>(cfg.gapMs),
                ratio, SENSOR_HYSTERESIS);
  Serial.printf("Adapt=%s mintravel=%lu step=%.1f%% | debug=%s | flash=%s\n",
                onOff(cfg.adapt), static_cast<unsigned long>(cfg.minTravelMs),
                cfg.adaptStepPct, onOff(cfg.debug), prefsReady ? "ready" : "unavailable");
}

void startAutoplay(bool clickToStart) {
  chooseBackground();
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  ++playGeneration;
  resetTimingLocked();
  playing = true;
  bool bg = backgroundIsWhite;
  int adc = lastSensorValue;
  xSemaphoreGive(stateMutex);
  clearClickQueue();

